nc: 80
scale: s
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, CSSPD, [64]]
  - [-1, 1, CSSPD, [128]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, MSSPD, [256]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, MSSPD, [512]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, SPPF, [512, 5]]
  - [-1, 2, C2PSA, [512]]

head:
  - [[2, 4, -1], 1, MBFusionA, [512]]
  - [-1, 3, C3k2, [512, False]]
  - [[-1, 2, 4], 1, MBFusionB, [256]]
  - [-1, 2, C3k2, [256, False]]
  - [[-1, 10], 1, MBFusionC, [512]]
  - [-1, 2, C3k2, [512, False]]
  - [[12, 14], 1, STHead, [nc, 1]]
